Configuration/3D/M4/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      forceCoeffs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
	type    forceCoeffs;
	libs   ("libforces.so");
	writeControl   timeStep;
	writeInterval   1;
	patches   ("cylinder");
	rho   rhoInf;
	log   true;
	rhoInf   1;
	liftDir   (0 1 0);
	dragDir   (1 0 0);
	CofR   (0 0 0);
	pitchAxis   (0 0 1);
	magUInf   0.46;
	lRef   0.2;
	Aref   0.02;
}


// ************************************************************************* //
